Revit 2026 API

# Entity(Entity) Constructor

---

Constructs a new copy of the input ESEntity object.

**Namespace:** Autodesk.Revit.DB.ExtensibleStorage**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Entity(
	Entity other
)
```
```vb
Public Sub New (
	other As Entity
)
```
```cpp
public:
Entity(
	Entity^ other
)
```
```fsharp
new :
        other : Entity -> Entity
```

#### Parameters

other Entity

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

Entity Class

Entity Overload

Autodesk.Revit.DB.ExtensibleStorage Namespace